"""
Вывод в консоль отображения
элементов игры и интерфейс пользователя
"""


class UiMatrix:
    """
    Отвечает за вывод текущего состояния игры в консоль
    """


class UiUtils:
    """
    Ввыод на экран
    Очков пользователя
    Доступных для активации бонусов
    Текущий ход (номер)
    """


class UiCommand:
    """
    Отвечает за отображение интерфейса ввода комманд пользователем
    для управления игрой
    """


class UserCommand:
    """
    Отвечает за управление пользователем игрой
    через интерфейс
    - Ввод ходов
    - Конце игры
    - Начать заново
    - Отмотать до x хода
    - Активировать бонус
    """
